# IExternalApplication Interface (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
IExternalApplication Interface
Members See Also
---
An interface that supports addition of external applications to Revit.
**Namespace:** Autodesk.Revit.UI**Assembly:** RevitAPIUI (in RevitAPIUI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public interface IExternalApplication
```

Visual Basic
---
```text
Public Interface IExternalApplication
```

Visual C++
---
```text
public interface class IExternalApplication
```

# Remarks
External applications are permitted to customize the Revit UI, and to add events and updaters to the session.
# See Also
IExternalApplication Members
Autodesk.Revit.UI Namespace